# GetValuesCount Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalDemandFactorDefinition..::..GetValuesCount Method
ElectricalDemandFactorDefinition Class See Also
---
Returns the number of values in the set.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2011
# Syntax
C#
---
```text
public int GetValuesCount()
```

Visual Basic
---
```text
Public Function GetValuesCount As Integer
```

Visual C++
---
```text
public:
int GetValuesCount()
```

# See Also
ElectricalDemandFactorDefinition Class
Autodesk.Revit.DB.Electrical Namespace